{
  "trainingPhrases": [ {
    "parts": [ {
      "text": "I'm trying to book a move for my purifier, but it says it can't be done. Why?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "Why isn't the move service available for my current or new address?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "I've been informed that moving my purifier isn't possible. What's the reason for this?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "The team says they can't set up my purifier at the new place. Why can't it be done?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "I'm moving to a new location, and I can't seem to schedule the purifier move. What's the reason?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "Why can't I get a technician to help move my purifier to my new place?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "I need to move my purifier, but they said it's not in a serviceable area. Why?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "Why is the move service not available for my new address?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "I want to move my purifier, but I'm being told it's not possible. Why?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "Why can't the technician come to uninstall and then reinstall my purifier?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "I'm trying to move my purifier, but it's not allowed. Can you explain?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "The service team said they can't help me move my purifier. What's the issue?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "Why is it not possible to move my purifier to another address?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "I was told I can't move my purifier to my new home. Why is that?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "Why can't I schedule a move for my purifier?"
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  }, {
    "parts": [ {
      "text": "I'm being rejected for reinstallation requests because I'm moving. It's frustrating that my entire moving process is disrupted because of the water purifier."
    } ],
    "repeatCount": 1,
    "languageCode": "en"
  } ]
}
